In [277]:
?data.frame

data.frame                package:base                 R Documentation

_D_a_t_a _F_r_a_m_e_s

_D_e_s_c_r_i_p_t_i_o_n:

     The function 'data.frame()' creates data frames, tightly coupled
     collections of variables which share many of the properties of
     matrices and of lists, used as the fundamental data structure by
     most of R's modeling software.

_U_s_a_g_e:

     data.frame(..., row.names = NULL, check.rows = FALSE,
                check.names = TRUE, fix.empty.names = TRUE,
                stringsAsFactors = default.stringsAsFactors())

     default.stringsAsFactors()

_A_r_g_u_m_e_n_t_s:

     ...: these arguments are of either the form 'value' or 'tag =
          value'.  Component names are created based on the tag (if
          present) or the deparsed argument itself.

row.names: 'NULL' or a single integer or character string specifying a
          column to be used as row names, or a character or integer
          vector giving the row names for the data frame.

check.rows: if 'TRUE' then the rows are checked for consistency of
          length and names.

check.names: logical.  If 'TRUE' then the names of the variables in the
          data frame are checked to ensure that they are syntactically
          valid variable names and are not duplicated.  If necessary
          they are adjusted (by 'make.names') so that they are.

fix.empty.names: logical indicating if arguments which are "unnamed"
          (in the sense of not being formally called as 'someName =
          arg') get an automatically constructed name or rather name
          '""'.  Needs to be set to 'FALSE' even when 'check.names' is
          false if '""' names should be kept.

stringsAsFactors: logical: should character vectors be converted to
          factors?  The 'factory-fresh' default is 'TRUE', but this can
          be changed by setting 'options(stringsAsFactors = FALSE)'.

_D_e_t_a_i_l_s:

     A data frame is a list of variables of the same number of rows
     with unique row names, given class '"data.frame"'.  If no
     variables are included, the row names determine the number of
     rows.

     The column names should be non-empty, and attempts to use empty
     names will have unsupported results.  Duplicate column names are
     allowed, but you need to use 'check.names = FALSE' for
     'data.frame' to generate such a data frame.  However, not all
     operations on data frames will preserve duplicated column names:
     for example matrix-like subsetting will force column names in the
     result to be unique.

     'data.frame' converts each of its arguments to a data frame by
     calling 'as.data.frame(optional = TRUE)'.  As that is a generic
     function, methods can be written to change the behaviour of
     arguments according to their classes: R comes with many such
     methods.  Character variables passed to 'data.frame' are converted
     to factor columns unless protected by 'I' or argument
     'stringsAsFactors' is false.  If a list or data frame or matrix is
     passed to 'data.frame' it is as if each component or column had
     been passed as a separate argument (except for matrices protected
     by 'I').

     Objects passed to 'data.frame' should have the same number of
     rows, but atomic vectors (see 'is.vector'), factors and character
     vectors protected by 'I' will be recycled a whole number of times
     if necessary (including as elements of list arguments).

     If row names are not supplied in the call to 'data.frame', the row
     names are taken from the first component that has suitable names,
     for example a named vector or a matrix with rownames or a data
     frame.  (If that component is subsequently recycled, the names are
     discarded with a warning.)  If 'row.names' was supplied as 'NULL'
     or no suitable component was found the row names are the integer
     sequence starting at one (and such row names are considered to be
     'automatic', and not preserved by 'as.matrix').

     If row names are supplied of length one and the data frame has a
     single row, the 'row.names' is taken to specify the row names and
     not a column (by name or number).

     Names are removed from vector inputs not protected by 'I'.

     'default.stringsAsFactors' is a utility that takes
     'getOption("stringsAsFactors")' and ensures the result is 'TRUE'
     or 'FALSE' (or throws an error if the value is not 'NULL').

_V_a_l_u_e:

     A data frame, a matrix-like structure whose columns may be of
     differing types (numeric, logical, factor and character and so
     on).

     How the names of the data frame are created is complex, and the
     rest of this paragraph is only the basic story.  If the arguments
     are all named and simple objects (not lists, matrices of data
     frames) then the argument names give the column names.  For an
     unnamed simple argument, a deparsed version of the argument is
     used as the name (with an enclosing 'I(...)' removed).  For a
     named matrix/list/data frame argument with more than one named
     column, the names of the columns are the name of the argument
     followed by a dot and the column name inside the argument: if the
     argument is unnamed, the argument's column names are used.  For a
     named or unnamed matrix/list/data frame argument that contains a
     single column, the column name in the result is the column name in
     the argument.  Finally, the names are adjusted to be unique and
     syntactically valid unless 'check.names = FALSE'.

_N_o_t_e:

     In versions of R prior to 2.4.0 'row.names' had to be character:
     to ensure compatibility with such versions of R, supply a
     character vector as the 'row.names' argument.

_R_e_f_e_r_e_n_c_e_s:

     Chambers, J. M. (1992) _Data for models._ Chapter 3 of
     _Statistical Models in S_ eds J. M. Chambers and T. J. Hastie,
     Wadsworth & Brooks/Cole.

_S_e_e _A_l_s_o:

     'I', 'plot.data.frame', 'print.data.frame', 'row.names', 'names'
     (for the column names), '[.data.frame' for subsetting methods and
     'I(matrix(..))' examples; 'Math.data.frame' etc, about _Group_
     methods for 'data.frame's; 'read.table', 'make.names'.

_E_x_a_m_p_l_e_s:

     L3 <- LETTERS[1:3]
     fac <- sample(L3, 10, replace = TRUE)
     (d <- data.frame(x = 1, y = 1:10, fac = fac))
     ## The "same" with automatic column names:
     data.frame(1, 1:10, sample(L3, 10, replace = TRUE))

     is.data.frame(d)

     ## do not convert to factor, using I() :
     (dd <- cbind(d, char = I(letters[1:10])))
     rbind(class = sapply(dd, class), mode = sapply(dd, mode))

     stopifnot(1:10 == row.names(d))  # {coercion}

     (d0  <- d[, FALSE])   # data frame with 0 columns and 10 rows
     (d.0 <- d[FALSE, ])   # <0 rows> data frame  (3 named cols)
     (d00 <- d0[FALSE, ])  # data frame with 0 columns and 0 rows

In [278]:
empty.dataframe <- data.frame()
print(empty.dataframe)

data frame with 0 columns and 0 rows

In [280]:
student.df <- data.frame('id'=NA, 'name'=NA, 'grade'=NA)
student.df

  id name grade
1 NA NA   NA

In [282]:
str(student.df)

'data.frame':	1 obs. of  3 variables:
 $ id   : logi NA
 $ name : logi NA
 $ grade: logi NA

In [284]:
ids <- 1000:1006
names <- c('Lucy', 'Desmond', 'Peter', 'Natasha', 'Tony', 'Steve', 'Pranoy')
grades <- c(3.4, 3.6, 7, 5.7, 5.9, 9.8, 9.2)

students.df <-data.frame(ids, names, grades)
students.df

  ids  names   grades
1 1000 Lucy    3.4
2 1001 Desmond 3.6
3 1002 Peter   7.0
4 1003 Natasha 5.7
5 1004 Tony    5.9
6 1005 Steve   9.8
7 1006 Pranoy  9.2

In [286]:
str(students.df)

'data.frame':	7 obs. of  3 variables:
 $ ids   : int  1000 1001 1002 1003 1004 1005 1006
 $ names : Factor w/ 7 levels "Desmond","Lucy",..: 2 1 4 3 7 6 5
 $ grades: num  3.4 3.6 7 5.7 5.9 9.8 9.2

In [288]:
students.df <-data.frame(ids, names, grades, stringsAsFactors = FALSE)
students.df

  ids  names   grades
1 1000 Lucy    3.4
2 1001 Desmond 3.6
3 1002 Peter   7.0
4 1003 Natasha 5.7
5 1004 Tony    5.9
6 1005 Steve   9.8
7 1006 Pranoy  9.2

In [290]:
str(students.df)

'data.frame':	7 obs. of  3 variables:
 $ ids   : int  1000 1001 1002 1003 1004 1005 1006
 $ names : chr  "Lucy" "Desmond" "Peter" "Natasha" ...
 $ grades: num  3.4 3.6 7 5.7 5.9 9.8 9.2

In [292]:
head(students.df, 3)

  ids  names   grades
1 1000 Lucy    3.4
2 1001 Desmond 3.6
3 1002 Peter   7.0

In [294]:
tail(students.df, 3)

  ids  names  grades
5 1004 Tony   5.9
6 1005 Steve  9.8
7 1006 Pranoy 9.2

In [296]:
students.df <-data.frame('ID'=ids, 'Name'=names, 'Grade'=grades, stringsAsFactors = FALSE)
students.df

  ID   Name    Grade
1 1000 Lucy    3.4
2 1001 Desmond 3.6
3 1002 Peter   7.0
4 1003 Natasha 5.7
5 1004 Tony    5.9
6 1005 Steve   9.8
7 1006 Pranoy  9.2

In [298]:
summary(students.df)

       ID           Name               Grade
 Min.   :1000   Length:7           Min.   :3.400
 1st Qu.:1002   Class :character   1st Qu.:4.650
 Median :1003   Mode  :character   Median :5.900
 Mean   :1003                      Mean   :6.371
 3rd Qu.:1004                      3rd Qu.:8.100
 Max.   :1006                      Max.   :9.800

In [300]:
names(students.df)

[1] "ID"    "Name"  "Grade"

In [302]:
rownames(students.df)

[1] "1" "2" "3" "4" "5" "6" "7"

In [304]:
rownames(students.df) <- LETTERS[1:7]
students.df

  ID   Name    Grade
A 1000 Lucy    3.4
B 1001 Desmond 3.6
C 1002 Peter   7.0
D 1003 Natasha 5.7
E 1004 Tony    5.9
F 1005 Steve   9.8
G 1006 Pranoy  9.2

In [306]:
dimnames(students.df)

[[1]]
[1] "A" "B" "C" "D" "E" "F" "G"

[[2]]
[1] "ID"    "Name"  "Grade"

In [308]:
nrow(students.df)

[1] 7

In [310]:
ncol(students.df)

[1] 3

In [312]:
students.df[[1]]

[1] 1000 1001 1002 1003 1004 1005 1006

In [314]:
students.df[[2]]

[1] "Lucy"    "Desmond" "Peter"   "Natasha" "Tony"    "Steve"   "Pranoy"

In [316]:
students.df$Name

[1] "Lucy"    "Desmond" "Peter"   "Natasha" "Tony"    "Steve"   "Pranoy"

In [318]:
students.df[1,2]

[1] "Lucy"

In [320]:
students.df[,2]

[1] "Lucy"    "Desmond" "Peter"   "Natasha" "Tony"    "Steve"   "Pranoy"

In [322]:
students.df[3,]

  ID   Name  Grade
C 1002 Peter 7

In [324]:
students.df[3:7,]

  ID   Name    Grade
C 1002 Peter   7.0
D 1003 Natasha 5.7
E 1004 Tony    5.9
F 1005 Steve   9.8
G 1006 Pranoy  9.2

In [326]:
students.df[c(2,5),]

  ID   Name    Grade
B 1001 Desmond 3.6
E 1004 Tony    5.9

In [328]:
students.df[3:7,2,drop=FALSE]

  Name
C Peter
D Natasha
E Tony
F Steve
G Pranoy

In [330]:
students.df[3:7,2,drop=TRUE]

[1] "Peter"   "Natasha" "Tony"    "Steve"   "Pranoy"

In [332]:
students.df[3:7,2]

[1] "Peter"   "Natasha" "Tony"    "Steve"   "Pranoy"

In [334]:
employee.df = data.frame(id = 1001:1007,
                         name = c('Amanda','Isaac','Philip','Peter','Tony','Kevin','Lily'),
                         department = c('Software Testing','Software Testing','Software Development','Software Development','Opetrations','Sales','HR'),
                         salary = c(135000, 28000, 90000, 140000, 200000, 35000, 50000),
                         stringsAsFactors = FALSE
                        )
employee.df

  id   name   department           salary
1 1001 Amanda Software Testing     135000
2 1002 Isaac  Software Testing      28000
3 1003 Philip Software Development  90000
4 1004 Peter  Software Development 140000
5 1005 Tony   Opetrations          200000
6 1006 Kevin  Sales                 35000
7 1007 Lily   HR                    50000

In [336]:
summary(employee.df)

       id           name            department            salary
 Min.   :1001   Length:7           Length:7           Min.   : 28000
 1st Qu.:1002   Class :character   Class :character   1st Qu.: 42500
 Median :1004   Mode  :character   Mode  :character   Median : 90000
 Mean   :1004                                         Mean   : 96857
 3rd Qu.:1006                                         3rd Qu.:137500
 Max.   :1007                                         Max.   :200000

In [338]:
software.employee.data <- employee.df[employee.df$department == 'Software Development',]
software.employee.data

  id   name   department           salary
3 1003 Philip Software Development  90000
4 1004 Peter  Software Development 140000

In [340]:
software.employee.data <- employee.df[grep("Software", employee.df$department),]
software.employee.data

  id   name   department           salary
1 1001 Amanda Software Testing     135000
2 1002 Isaac  Software Testing      28000
3 1003 Philip Software Development  90000
4 1004 Peter  Software Development 140000

In [342]:
employee.df[employee.df$salary >= 100000,]

  id   name   department           salary
1 1001 Amanda Software Testing     135000
4 1004 Peter  Software Development 140000
5 1005 Tony   Opetrations          200000

In [344]:
employee.df[employee.df$salary < 50000 | employee.df$department == 'Sales',]

  id   name  department       salary
2 1002 Isaac Software Testing 28000
6 1006 Kevin Sales            35000

In [346]:
employee.df[employee.df$salary < 50000 & employee.df$department == 'Sales',]

  id   name  department salary
6 1006 Kevin Sales      35000

In [348]:
mark <- list(1010, 'Mark', 'Sales', 50000)
mark

[[1]]
[1] 1010

[[2]]
[1] "Mark"

[[3]]
[1] "Sales"

[[4]]
[1] 50000

In [350]:
employee.df <- rbind(employee.df, mark)
employee.df

  id   name   department           salary
1 1001 Amanda Software Testing     135000
2 1002 Isaac  Software Testing      28000
3 1003 Philip Software Development  90000
4 1004 Peter  Software Development 140000
5 1005 Tony   Opetrations          200000
6 1006 Kevin  Sales                 35000
7 1007 Lily   HR                    50000
8 1010 Mark   Sales                 50000

In [352]:
employee.df[employee.df$salary <= 50000,]

  id   name  department       salary
2 1002 Isaac Software Testing 28000
6 1006 Kevin Sales            35000
7 1007 Lily  HR               50000
8 1010 Mark  Sales            50000

In [354]:
employee.df[employee.df$salary == 50000,]

  id   name department salary
7 1007 Lily HR         50000
8 1010 Mark Sales      50000

In [356]:
employee.new <- data.frame(id = c(1018, 1019, 1020),
                         name = c('Donal', 'Robert', 'Wanda'),
                         department = c('Software Development', 'Production', 'HR'),
                         salary = c(135000, 85000, 45000),
                         stringsAsFactors = FALSE
                        )
employee.new

  id   name   department           salary
1 1018 Donal  Software Development 135000
2 1019 Robert Production            85000
3 1020 Wanda  HR                    45000

In [358]:
employee.df <- rbind(employee.df, employee.new)
employee.df

   id   name   department           salary
1  1001 Amanda Software Testing     135000
2  1002 Isaac  Software Testing      28000
3  1003 Philip Software Development  90000
4  1004 Peter  Software Development 140000
5  1005 Tony   Opetrations          200000
6  1006 Kevin  Sales                 35000
7  1007 Lily   HR                    50000
8  1010 Mark   Sales                 50000
9  1018 Donal  Software Development 135000
10 1019 Robert Production            85000
11 1020 Wanda  HR                    45000

In [360]:
employee.type <- sample(c('Contract', 'Fulltime'), size = nrow(employee.df), replace = TRUE)
employee.type

 [1] "Contract" "Contract" "Contract" "Fulltime" "Fulltime" "Fulltime"
 [7] "Contract" "Fulltime" "Fulltime" "Fulltime" "Contract"

In [362]:
employee.df <- cbind(employee.df, type=employee.type)
employee.df

   id   name   department           salary type
1  1001 Amanda Software Testing     135000 Contract
2  1002 Isaac  Software Testing      28000 Contract
3  1003 Philip Software Development  90000 Contract
4  1004 Peter  Software Development 140000 Fulltime
5  1005 Tony   Opetrations          200000 Fulltime
6  1006 Kevin  Sales                 35000 Fulltime
7  1007 Lily   HR                    50000 Contract
8  1010 Mark   Sales                 50000 Fulltime
9  1018 Donal  Software Development 135000 Fulltime
10 1019 Robert Production            85000 Fulltime
11 1020 Wanda  HR                    45000 Contract

In [364]:
employee.df$gender <- c('F', 'M', 'M', 'M', 'M', 'M', 'F', 'M', 'F', 'M', 'F')
employee.df

   id   name   department           salary type     gender
1  1001 Amanda Software Testing     135000 Contract F
2  1002 Isaac  Software Testing      28000 Contract M
3  1003 Philip Software Development  90000 Contract M
4  1004 Peter  Software Development 140000 Fulltime M
5  1005 Tony   Opetrations          200000 Fulltime M
6  1006 Kevin  Sales                 35000 Fulltime M
7  1007 Lily   HR                    50000 Contract F
8  1010 Mark   Sales                 50000 Fulltime M
9  1018 Donal  Software Development 135000 Fulltime F
10 1019 Robert Production            85000 Fulltime M
11 1020 Wanda  HR                    45000 Contract F

In [368]:
employee.df$indcrement <- ifelse(employee.df$salary < 50000,
                                0.1 * employee.df$salary,
                                0)
employee.df

   id   name   department           salary type     gender indcrement
1  1001 Amanda Software Testing     135000 Contract F         0
2  1002 Isaac  Software Testing      28000 Contract M      2800
3  1003 Philip Software Development  90000 Contract M         0
4  1004 Peter  Software Development 140000 Fulltime M         0
5  1005 Tony   Opetrations          200000 Fulltime M         0
6  1006 Kevin  Sales                 35000 Fulltime M      3500
7  1007 Lily   HR                    50000 Contract F         0
8  1010 Mark   Sales                 50000 Fulltime M         0
9  1018 Donal  Software Development 135000 Fulltime F         0
10 1019 Robert Production            85000 Fulltime M         0
11 1020 Wanda  HR                    45000 Contract F      4500

In [370]:
employee.df$NewSalary <- employee.df$salary + employee.df$indcrement
employee.df

   id   name   department           salary type     gender indcrement NewSalary
1  1001 Amanda Software Testing     135000 Contract F         0       135000
2  1002 Isaac  Software Testing      28000 Contract M      2800        30800
3  1003 Philip Software Development  90000 Contract M         0        90000
4  1004 Peter  Software Development 140000 Fulltime M         0       140000
5  1005 Tony   Opetrations          200000 Fulltime M         0       200000
6  1006 Kevin  Sales                 35000 Fulltime M      3500        38500
7  1007 Lily   HR                    50000 Contract F         0        50000
8  1010 Mark   Sales                 50000 Fulltime M         0        50000
9  1018 Donal  Software Development 135000 Fulltime F         0       135000
10 1019 Robert Production            85000 Fulltime M         0        85000
11 1020 Wanda  HR                    45000 Contract F      4500        49500

In [1]:
df1 <- data.frame(
  ID = c(1, 2, 3, 4),
  Name = c("Alice", "Bob", "Charlie", "David"),
  Age = c(25, 30, 35, 40)
)

df2 <- data.frame(
  ID = c(3, 4, 5, 6),
  City = c("New York", "Los Angeles", "Chicago", "Houston"),
  Salary = c(70000, 80000, 90000, 100000)
)

In [3]:
df1

  ID Name    Age
1 1  Alice   25
2 2  Bob     30
3 3  Charlie 35
4 4  David   40

In [5]:
df2

  ID City        Salary
1 3  New York    7e+04
2 4  Los Angeles 8e+04
3 5  Chicago     9e+04
4 6  Houston     1e+05

In [7]:
merge(df1, df2)

  ID Name    Age City        Salary
1 3  Charlie 35  New York    70000
2 4  David   40  Los Angeles 80000

In [9]:
df1 <- data.frame(
  ID = c(1, 2, 3, 4),
  Name = c("Alice", "Bob", "Charlie", "David"),
  Age = c(25, 30, 35, 40)
)

df2 <- data.frame(
  IDs = c(3, 4, 5, 6),
  Cities = c("New York", "Los Angeles", "Chicago", "Houston"),
  Salary = c(70000, 80000, 90000, 100000)
)
merge(df1, df2)

   ID Name    Age IDs Cities      Salary
1  1  Alice   25  3   New York    7e+04
2  2  Bob     30  3   New York    7e+04
3  3  Charlie 35  3   New York    7e+04
4  4  David   40  3   New York    7e+04
5  1  Alice   25  4   Los Angeles 8e+04
6  2  Bob     30  4   Los Angeles 8e+04
7  3  Charlie 35  4   Los Angeles 8e+04
8  4  David   40  4   Los Angeles 8e+04
9  1  Alice   25  5   Chicago     9e+04
10 2  Bob     30  5   Chicago     9e+04
11 3  Charlie 35  5   Chicago     9e+04
12 4  David   40  5   Chicago     9e+04
13 1  Alice   25  6   Houston     1e+05
14 2  Bob     30  6   Houston     1e+05
15 3  Charlie 35  6   Houston     1e+05
16 4  David   40  6   Houston     1e+05

In [11]:
merge(df1, df2, by.x='ID', by.y='IDs')

  ID Name    Age Cities      Salary
1 3  Charlie 35  New York    70000
2 4  David   40  Los Angeles 80000

In [14]:
gender <- c('Male', 'Female','Male', 'Female','Male', 'Female')
gender

[1] "Male"   "Female" "Male"   "Female" "Male"   "Female"

In [16]:
class(gender)

[1] "character"

In [18]:
gender.factor <- factor(gender)
gender.factor

[1] Male   Female Male   Female Male   Female
Levels: Female Male

In [20]:
class(gender.factor)

[1] "factor"

In [22]:
str(gender.factor)

 Factor w/ 2 levels "Female","Male": 2 1 2 1 2 1

In [24]:
unclass(gender.factor)

[1] 2 1 2 1 2 1
attr(,"levels")
[1] "Female" "Male"

In [26]:
gender.factor <- factor(gender, levels=c('Female', 'Male', 'Other'))
gender.factor

[1] Male   Female Male   Female Male   Female
Levels: Female Male Other

In [28]:
gender.factor[7] <- 'Other'

gender.factor

[1] Male   Female Male   Female Male   Female Other
Levels: Female Male Other

In [30]:
levels(gender.factor)

[1] "Female" "Male"   "Other"

In [32]:
str(gender.factor)

 Factor w/ 3 levels "Female","Male",..: 2 1 2 1 2 1 3

In [34]:
summary(gender.factor)

Female   Male  Other
     3      3      1